In [48]:
import sqlalchemy

from sqlalchemy import create_engine, MetaData, Table, inspect


import pandas as pd
url = 'https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/base-de-dados/aluguel.csv'
dados = pd.read_csv(url, sep=';')



engine = create_engine('sqlite:///:memory:')

dados.to_sql('aluguel', engine, index=False)

inspector = inspect(engine)

print(inspector.get_table_names())

query = 'SELECT Tipo, Bairro, Quartos FROM aluguel WHERE Quartos > 0'

aluguel = pd.read_sql(query, engine);
aluguel.head()


pd.read_sql_table('aluguel', engine);

query = 'DELETE FROM aluguel where Quartos = 2'
with engine.connect() as conn:
    conn.execute(query)

['aluguel']

ObjectNotExecutableError: Not an executable object: 'DELETE FROM aluguel where Quartos = 2'

In [24]:
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Bot창nico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higien처polis,1,0,0,48,800.0,230.0,NaN

In [ ]:
dataframe.melt(id_vars = [...], value_vars = [...], var_name = '..', value_name = '..')